import os

from util.client import client

data = {
    "id": 0,  # 活动主键
    "importKey": "",  # 导入操作键
    "sourceType": 0,  # 来源类型:1-活动,2-优惠券派发,3-登录提醒,4-领券中心(上架对象),5-分享领券（分享人）,6-分享领券（助力人）,7-抽奖活动(活动顾客),8-抽奖活动(不可参加顾客),9-优惠券派发（不派发顾客）,10-签约购活动,11-签约购活动（不可购顾客）,12-签约购活动历史表,13-签约购活动（可购顾客）,14-随心购活动,15-随心购活动（可购顾客）,16-随心购活动（不可购顾客）,17-C端转赠优惠券对象限制,18-签约购活动3.0,19-签约购活动3.0(不可购顾客),20-签约购活动3.0历史表,21-签约购活动3.0(可购顾客)22-领券中心(领取对象),23-3S组合活动,24-3S组合活动(可购顾客),25-3S组合活动(不可购顾客)26-签约购4.0活动,27-签约购4.0活动(不可购顾客),28-签约购4.0活动历史表,29-签约购4.0活动(可购顾客)
    "type": 0,  # 领券中心导入顾客类型：0-上架对象，1-领取对象
}

headers = {
    "authorization": f"bearer {os.environ['access_token']}",
    "content-length": "0",
}


def _mgmt_prmt_memberImport_startImportAll(data=data, headers=headers):
    """
    全部开始导入
    /mgmt/prmt/memberImport/startImportAll

    参数说明:
    - id: 活动主键
    - importKey: 导入操作键
    - sourceType: 来源类型:1-活动,2-优惠券派发,3-登录提醒,4-领券中心(上架对象),5-分享领券（分享人）,6-分享领券（助力人）,7-抽奖活动(活动顾客),8-抽奖活动(不可参加顾客),9-优惠券派发（不派发顾客）,10-签约购活动,11-签约购活动（不可购顾客）,12-签约购活动历史表,13-签约购活动（可购顾客）,14-随心购活动,15-随心购活动（可购顾客）,16-随心购活动（不可购顾客）,17-C端转赠优惠券对象限制,18-签约购活动3.0,19-签约购活动3.0(不可购顾客),20-签约购活动3.0历史表,21-签约购活动3.0(可购顾客)22-领券中心(领取对象),23-3S组合活动,24-3S组合活动(可购顾客),25-3S组合活动(不可购顾客)26-签约购4.0活动,27-签约购4.0活动(不可购顾客),28-签约购4.0活动历史表,29-签约购4.0活动(可购顾客)
    - type: 领券中心导入顾客类型：0-上架对象，1-领取对象
    """

    url = "/mgmt/prmt/memberImport/startImportAll"
    with client.post(url=url, json=data, headers=headers) as r:
        return r
